
#include "Input.h"


BYTE Input::m_OldKeyState[256];
BYTE Input::m_KeyState[256];

/***************************************************************************
[概要]
初期化処理

[戻り値]
void
***************************************************************************/
void Input::Init()
{
	memset( m_OldKeyState, 0, 256 );
	memset( m_KeyState, 0, 256 );
}

/***************************************************************************
[概要]
更新処理

[戻り値]
void
***************************************************************************/
void Input::Update()
{
	// 古い入力を更新
	memcpy( m_OldKeyState, m_KeyState, 256 );
	// 現在の入力を取得
	GetKeyboardState( m_KeyState );
}

/***************************************************************************
[概要]
キーが押されているか判定

[戻り値]
bool
***************************************************************************/
bool Input::GetKeyPress(BYTE KeyCode)
{
	return (m_KeyState[KeyCode] & 0x80);
}

/***************************************************************************
[概要]
キーが押されたか

[戻り値]
bool
***************************************************************************/
bool Input::GetKeyTrigger(BYTE KeyCode)
{
	return ((m_KeyState[KeyCode] & 0x80) && !(m_OldKeyState[KeyCode] & 0x80));
}

/***************************************************************************
[概要]
キーを離したか判定(押されている場合)

[戻り値]
bool
***************************************************************************/
bool Input::GetKeyRelease(BYTE KeyCode)
{
	return (m_KeyState[KeyCode] ^ m_OldKeyState[KeyCode]) & m_OldKeyState[KeyCode] & 0x80;
}
