#pragma once
#include "Main.h"

class Time
{
public:
	/***************************************************************************
	[概要]
	初期化処理
	
	[戻り値]
	void
	***************************************************************************/
	static void Init();

	/***************************************************************************
	[概要]
	メモリの解放処理

	[戻り値]
	void
	***************************************************************************/
	static void Uninit();

	/***************************************************************************
	[概要]
	更新処理

	[戻り値]
	bool 1秒経過しているか判定
	***************************************************************************/
	static bool Update();

private:
	static DWORD m_dwExecLastTime;
	static DWORD m_dwCurrentTime;
	static float m_Frame;
	static bool m_HitStopFlg;
	static int m_GameCount;
};