#pragma once
#include "GameObject.h"

class Transition : public GameObject
{
public:
	enum class State
	{
		Stop,
		In,
		Out,
		Finish
	};

public:
	/***************************************************************************
	[概要]
	初期化処理
	
	[戻り値]
	void
	***************************************************************************/
	void Init() override;

	/***************************************************************************
	[概要]
	更新処理

	[戻り値]
	void
	***************************************************************************/
	void Update() override;

	/***************************************************************************
	[概要]
	現在のシーン遷移の状態取得

	[戻り値]
	State 現在のシーン遷移の状態
	***************************************************************************/
	State GetState() { return m_State; }

	/***************************************************************************
	[概要]
	フェードイン
	
	[戻り値]
	void
	***************************************************************************/
	void FadeIn()
	{
		m_Alpha = 1.0f;
		m_State = State::In;
	}

	/***************************************************************************
	[概要]
	フェードアウト

	[戻り値]
	void
	***************************************************************************/
	void FadeOut()
	{
		m_Alpha = 0.0f;
		m_State = State::Out;
	}

private:
	State m_State = State::Stop; // 現在のフェードの状態
	float m_Alpha = 0.0f;
	class Sprite* m_Sprite{};
};