// Titleシーン [title.h]
#pragma once
#include "Scene.h"

class Scene_Title : public Scene
{
public:
	/***************************************************************************
	[概要]
	シーンの初期化

	[戻り値]
	void
	***************************************************************************/
	void Init() override;

	/***************************************************************************
	[概要]
	シーンの更新

	[戻り値]
	void
	***************************************************************************/
	void Update() override;

	/***************************************************************************
	[概要]
	入力処理

	[戻り値]
	void
	***************************************************************************/
	void KeyPress();

	/***************************************************************************
	[概要]
	選択中のUIを拡縮させる

	[戻り値]
	void
	***************************************************************************/
	void UI_Scaling();

	/***************************************************************************
	[概要]
	シーン遷移

	[戻り値]
	void
	***************************************************************************/
	void SceneTransition();


private:
	class Audio* m_TitleBGM{};
	class Transition* m_Transition{};
	class Collision* m_Collision{};

	const float m_ExchangeTime = 0.8f;  // UIの選択画面が切り替えが可能になる時間

	float m_Time = 0.0f;          // 現在時間のカウント用
	int UI_select = 0;            // ゲーム開始か終了の判別用　（0:Start、1:End）
	bool m_TransitionFlg = false; // フェードアウトするか判定用
	bool m_SelectFlg = false;     // UIの入力受付判定用
};
