#pragma once
#include "GameObject.h"

class PlayerBall : public GameObject
{
public:
	/***************************************************************************
	[概要]
	プレイヤー初期化
	
	[戻り値]
	void
	***************************************************************************/
	void Init() override;
	
	/***************************************************************************
	[概要]
	プレイヤー更新処理
	
	[戻り値]
	void
	***************************************************************************/
	void Update() override;

	/***************************************************************************
	[概要]
	プレイヤーヒットストップ用更新処理
	
	[戻り値]
	void
	***************************************************************************/
	void HitStopUpdate() override;

	/***************************************************************************
	[概要]
　　移動速度を設定

	[戻り値]
	void
	***************************************************************************/
	void VelocitySetting();

	/***************************************************************************
	[概要]
	移動処理
	
	[戻り値]
	void
	***************************************************************************/
	void Move();

	/***************************************************************************
	[概要]
	攻撃準備
	
	[戻り値]
	void
	***************************************************************************/
	void Charge();

	/***************************************************************************
	[概要]
	攻撃処理

	[引数]
	float              const& power　　加速力
	DirectX::XMFLOAT3  const& forward　攻撃方向

	[戻り値]
	void
	***************************************************************************/
	void Attack(float const& power, DirectX::XMFLOAT3 const& forward);

private:

	class Audio* m_CollisionSE{};
	class Audio* m_ChargeSE{};
	class Audio* m_AttackSE{};
	class Camera* m_Camera{};
	class Collision* m_Collision{};

	class Effect_Charge* m_Effect_Charge;
};
